In [9]:
import pandas as pd

In [10]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

In [11]:
s[['a', 'd']]

a    3
d    4
dtype: int64

In [12]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
           'Capital': ['Brussels', 'New Delhi', 'Brasília'],
           'Population': [11190846, 1303171035, 207847528]}

In [13]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasília'],
 'Population': [11190846, 1303171035, 207847528]}

In [14]:
type(data)

dict

In [15]:
df = pd.DataFrame(data)
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [16]:
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [18]:
df1 = df[['Country', 'Population']]
df1

   Country  Population
0  Belgium    11190846
1    India  1303171035
2   Brazil   207847528

In [19]:
df.iloc[0,1]

'Brussels'

In [20]:
# you get row 0
df.iloc[0,:]

Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object

In [22]:
df1.iloc[0,0] = 'Turkey'
df1

  Country  Population
0  Turkey    11190846
1   India  1303171035
2  Brazil   207847528

In [23]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [26]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [27]:
s[(s > 1)]

a    3
c    7
d    4
dtype: int64

In [30]:
# Filter data
s[~(s > 1)]

b   -5
dtype: int64

In [26]:
s[(s < -1) & (s > 2)]

Series([], dtype: int64)

In [27]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [32]:
df[df.Population > 200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [37]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [38]:
s.drop(['a'], inplace=True)

In [39]:
s

b   -5
c    7
d    4
dtype: int64

In [40]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [44]:
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [45]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [48]:
df.sort_values(by='Population', ascending=False)

   Country    Capital  Population
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528
0  Belgium   Brussels    11190846

In [49]:
df.shape

(3, 3)

In [50]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [55]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [56]:
df.mean()

Population    5.074031e+08
dtype: float64

In [58]:
df.Population.sum()

1522209409

In [59]:
def square(x):
    return 2*x

In [63]:
df['Population'] = df['Population'].apply(square)

In [64]:
df['Population']

0      22381692
1    2606342070
2     415695056
Name: Population, dtype: int64

In [65]:
df

   Country    Capital  Population
0  Belgium   Brussels    22381692
1    India  New Delhi  2606342070
2   Brazil   Brasília   415695056

### Pivot Ornegi
 - [kaynak](http://shichaoji.com/category/pandas/)

In [5]:
sales = pd.DataFrame({'eggs': {0: 47, 1: 110, 2: 221, 3: 77, 4: 132, 5: 205},
 'month': {0: 1, 1: 2, 2: 1, 3: 2, 4: 1, 5: 2},
 'salt': {0: 12.0, 1: 50.0, 2: 89.0, 3: 87.0, 4: None, 5: 60.0},
 'spam': {0: 17, 1: 31, 2: 72, 3: 20, 4: 52, 5: 55},
 'state': {0: 'CA', 1: 'CA', 2: 'NY', 3: 'NY', 4: 'TX', 5: 'TX'}})

In [6]:
sales

   eggs  month  salt  spam state
0    47      1  12.0    17    CA
1   110      2  50.0    31    CA
2   221      1  89.0    72    NY
3    77      2  87.0    20    NY
4   132      1   NaN    52    TX
5   205      2  60.0    55    TX

In [7]:
sales.pivot(index = 'month',
            columns = 'state',
            values = 'spam')

state  CA  NY  TX
month
1      17  72  52
2      31  20  55

In [8]:
sales.pivot(index = 'month', columns = 'state')

      eggs            salt             spam
state   CA   NY   TX    CA    NY    TX   CA  NY  TX
month
1       47  221  132  12.0  89.0   NaN   17  72  52
2      110   77  205  50.0  87.0  60.0   31  20  55

In [9]:
users = pd.DataFrame({'city': {0: 'Austin', 1: 'Dallas', 2: 'Austin', 3: 'Dallas'},
 'signups': {0: 7, 1: 12, 2: 3, 3: 5},
 'visitors': {0: 139, 1: 237, 2: 326, 3: 456},
 'weekday': {0: 'Sun', 1: 'Sun', 2: 'Mon', 3: 'Mon'}})

In [10]:
users

     city  signups  visitors weekday
0  Austin        7       139     Sun
1  Dallas       12       237     Sun
2  Austin        3       326     Mon
3  Dallas        5       456     Mon

### Multi-level index

In [12]:
users2 = users.set_index(['city','weekday'])
users2

                signups  visitors
city   weekday
Austin Sun            7       139
Dallas Sun           12       237
Austin Mon            3       326
Dallas Mon            5       456

In [14]:
users2.index

MultiIndex(levels=[['Austin', 'Dallas'], ['Mon', 'Sun']],
           labels=[[0, 1, 0, 1], [1, 1, 0, 0]],
           names=['city', 'weekday'])

In [15]:
grouped = users.pivot('city','weekday','visitors')
grouped

weekday  Mon  Sun
city
Austin   326  139
Dallas   456  237

In [16]:
users.pivot('city','weekday')

        signups     visitors
weekday     Mon Sun      Mon  Sun
city
Austin        3   7      326  139
Dallas        5  12      456  237